# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить, к какому времени года относится месяц
# (зима, весна, лето, осень). Напишите решения через list и dict.

in_month = int(input('введите номер месяца: '))
list_month = ['', 'Зима', 'Зима', 'Весна', 'Весна', 'Весна', 'Лето', 'Лето', 'Лето', 'Осень', 'Осень', 'Осень', 'Зима']
print('Решение через list:')
print(list_month[in_month])
dict_month = {1: 'Зима', 2: 'Зима', 3: 'Весна',
              4: 'Весна', 5: 'Весна', 6: 'Лето',
              7: 'Лето', 8: 'Лето', 9: 'Осень',
              10: 'Осень', 11: 'Осень', 12: 'Весна'}
print('Решение через dict:')
print(dict_month.get(in_month))
